ankuns/nrfx/bsp/stable/mdk/nrf7140_secure_peripherals.h
/*CM33 SubSystem*/
#define CM33SS_PRESENT 1
#define CM33SS_COUNT 1

#define CPUC_FPUAVAILABLE 0                          /*!< (unspecified)                                                        */

/*Cache*/
#define CACHE_PRESENT 1
#define CACHE_COUNT 2

#define ICACHE_VIRTUALCACHE 0                        /*!< (unspecified)                                                        */
#define ICACHE_FLUSH 0                               /*!< (unspecified)                                                        */
#define ICACHE_CLEAN 0                               /*!< (unspecified)                                                        */
#define ICACHE_NONCACHEABLEMISS 1                    /*!< (unspecified)                                                        */
#define ICACHE_BUSWIDTH_MIN 0                        /*!< Data bus width : 0..63                                               */
#define ICACHE_BUSWIDTH_MAX 63                       /*!< Data bus width : 0..63                                               */
#define ICACHE_BUSWIDTH_SIZE 64                      /*!< Data bus width : 0..63                                               */
#define ICACHE_SECUREINVALIDATE 1                    /*!< (unspecified)                                                        */

#define DCACHE_VIRTUALCACHE 0                        /*!< (unspecified)                                                        */
#define DCACHE_FLUSH 1                               /*!< (unspecified)                                                        */
#define DCACHE_CLEAN 1                               /*!< (unspecified)                                                        */
#define DCACHE_NONCACHEABLEMISS 1                    /*!< (unspecified)                                                        */
#define DCACHE_BUSWIDTH_MIN 0                        /*!< Data bus width : 0..63                                               */
#define DCACHE_BUSWIDTH_MAX 63                       /*!< Data bus width : 0..63                                               */
#define DCACHE_BUSWIDTH_SIZE 64                      /*!< Data bus width : 0..63                                               */
#define DCACHE_SECUREINVALIDATE 1                    /*!< (unspecified)                                                        */

/*System protection unit*/
#define SPU_PRESENT 1
#define SPU_COUNT 19

#define SPU000_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU000_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU000_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU000_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU000_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU000_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU000_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU000_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU000_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU000_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU000_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU000_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU000_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU000_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU000_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU000_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU000_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU000_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU000_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU000_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

#define SPU010_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU010_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU010_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU010_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU010_IPCT 1                                /*!< (unspecified)                                                        */
#define SPU010_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU010_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU010_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU010_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU010_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU010_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU010_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU010_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU010_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU010_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU010_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU010_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU010_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU010_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU010_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

#define SPU310_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU310_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU310_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU310_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU310_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU310_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU310_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU310_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU310_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU310_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU310_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU310_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU310_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU310_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU310_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU310_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU310_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU310_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU310_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU310_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

#define SPU410_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU410_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU410_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU410_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU410_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU410_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU410_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU410_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU410_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU410_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU410_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU410_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU410_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU410_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU410_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU410_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU410_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU410_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU410_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU410_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

