ankuns/nrfx/bsp/stable/mdk/nrf7140_secure_peripherals.h
#define SPU200_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU200_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU200_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU200_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU200_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU200_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU200_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU200_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU200_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU200_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU200_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU200_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU200_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU200_TDD 1                                 /*!< (unspecified)                                                        */
#define SPU200_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU200_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU200_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU200_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU200_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU200_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

#define SPU210_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU210_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU210_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU210_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU210_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU210_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU210_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU210_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU210_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU210_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU210_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU210_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU210_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU210_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU210_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU210_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU210_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU210_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU210_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU210_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

#define SPU110_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU110_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU110_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU110_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU110_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU110_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU110_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU110_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU110_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU110_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU110_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU110_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU110_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU110_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU110_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU110_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU110_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU110_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU110_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU110_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

#define SPU111_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU111_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU111_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU111_BELLS 1                               /*!< (unspecified)                                                        */
#define SPU111_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU111_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU111_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU111_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU111_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU111_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU111_MRAMC 1                               /*!< (unspecified)                                                        */
#define SPU111_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU111_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU111_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU111_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU111_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU111_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU111_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU111_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU111_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

#define SPU120_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU120_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU120_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU120_BELLS 1                               /*!< (unspecified)                                                        */
#define SPU120_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU120_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU120_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU120_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU120_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU120_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU120_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU120_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU120_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU120_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU120_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU120_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU120_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU120_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU120_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU120_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

#define SPU121_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU121_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU121_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU121_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU121_IPCT 1                                /*!< (unspecified)                                                        */
#define SPU121_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU121_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU121_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU121_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU121_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU121_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU121_COEXC 1                               /*!< (unspecified)                                                        */
#define SPU121_ANTSWC 1                              /*!< (unspecified)                                                        */
#define SPU121_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU121_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU121_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU121_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU121_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU121_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU121_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

#define SPU122_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU122_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU122_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU122_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU122_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU122_DPPI 1                                /*!< (unspecified)                                                        */
#define SPU122_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU122_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU122_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU122_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU122_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU122_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU122_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU122_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU122_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU122_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU122_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU122_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU122_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU122_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

#define SPU130_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU130_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU130_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU130_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU130_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU130_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU130_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU130_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU130_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU130_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU130_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU130_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU130_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU130_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU130_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU130_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU130_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU130_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU130_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU130_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

