ankuns/nrfx/bsp/stable/mdk/nrf7140_secure_peripherals.h
/*HSFLL*/
#define HSFLL_PRESENT 1
#define HSFLL_COUNT 4

#define HSFLL_DITHER_32B 1                           /*!< (unspecified)                                                        */
#define HSFLL_CLOCKCTRL_MULT_RESET 4                 /*!< Reset value of register CLOCKCTRL.MULT: clockctrl_mult_reset         */
#define HSFLL_CLOCKCTRL_INTEGER_DIVISION 0           /*!< (unspecified)                                                        */

#define HSFLL300_DITHER_32B 1                        /*!< (unspecified)                                                        */
#define HSFLL300_CLOCKCTRL_MULT_RESET 4              /*!< Reset value of register CLOCKCTRL.MULT: clockctrl_mult_reset         */
#define HSFLL300_CLOCKCTRL_INTEGER_DIVISION 0        /*!< (unspecified)                                                        */

#define HSFLL122_DITHER_32B 1                        /*!< (unspecified)                                                        */
#define HSFLL122_CLOCKCTRL_MULT_RESET 4              /*!< Reset value of register CLOCKCTRL.MULT: clockctrl_mult_reset         */
#define HSFLL122_CLOCKCTRL_INTEGER_DIVISION 1        /*!< (unspecified)                                                        */

#define HSFLL121_DITHER_32B 1                        /*!< (unspecified)                                                        */
#define HSFLL121_CLOCKCTRL_MULT_RESET 4              /*!< Reset value of register CLOCKCTRL.MULT: clockctrl_mult_reset         */
#define HSFLL121_CLOCKCTRL_INTEGER_DIVISION 0        /*!< (unspecified)                                                        */

/*LRCCONF*/
#define LRCCONF_PRESENT 1
#define LRCCONF_COUNT 5

#define LRCCONF000_POWERON 0                         /*!< (unspecified)                                                        */
#define LRCCONF000_RETAIN 0                          /*!< (unspecified)                                                        */
#define LRCCONF000_SYSTEMOFF 0                       /*!< (unspecified)                                                        */
#define LRCCONF000_LRCREQHFXO 0                      /*!< (unspecified)                                                        */
#define LRCCONF000_NCLK_MIN 0                        /*!< (unspecified)                                                        */
#define LRCCONF000_NCLK_MAX 0                        /*!< (unspecified)                                                        */
#define LRCCONF000_NCLK_SIZE 1                       /*!< (unspecified)                                                        */
#define LRCCONF000_CLKCTRL 1                         /*!< (unspecified)                                                        */
#define LRCCONF000_NACTPD_MIN 0                      /*!< (unspecified)                                                        */
#define LRCCONF000_NACTPD_MAX 7                      /*!< (unspecified)                                                        */
#define LRCCONF000_NACTPD_SIZE 8                     /*!< (unspecified)                                                        */
#define LRCCONF000_PDACT 0                           /*!< (unspecified)                                                        */
#define LRCCONF000_NPD_MIN 0                         /*!< (unspecified)                                                        */
#define LRCCONF000_NPD_MAX 7                         /*!< (unspecified)                                                        */
#define LRCCONF000_NPD_SIZE 8                        /*!< (unspecified)                                                        */
#define LRCCONF000_OTHERON 0                         /*!< (unspecified)                                                        */
#define LRCCONF000_NDOMAINS_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF000_NDOMAINS_MAX 15                   /*!< (unspecified)                                                        */
#define LRCCONF000_NDOMAINS_SIZE 16                  /*!< (unspecified)                                                        */
#define LRCCONF000_AX2XWAITSTATES 0                  /*!< (unspecified)                                                        */
#define LRCCONF000_POWERON_MAIN_RESET 0              /*!< (unspecified)                                                        */
#define LRCCONF000_POWERON_ACT_RESET 0               /*!< (unspecified)                                                        */
#define LRCCONF000_RETAIN_MAIN_RESET 1               /*!< (unspecified)                                                        */
#define LRCCONF000_RETAIN_ACT_RESET 1                /*!< (unspecified)                                                        */

#define LRCCONF010_POWERON 1                         /*!< (unspecified)                                                        */
#define LRCCONF010_RETAIN 1                          /*!< (unspecified)                                                        */
#define LRCCONF010_SYSTEMOFF 1                       /*!< (unspecified)                                                        */
#define LRCCONF010_LRCREQHFXO 1                      /*!< (unspecified)                                                        */
#define LRCCONF010_NCLK_MIN 0                        /*!< (unspecified)                                                        */
#define LRCCONF010_NCLK_MAX 0                        /*!< (unspecified)                                                        */
#define LRCCONF010_NCLK_SIZE 1                       /*!< (unspecified)                                                        */
#define LRCCONF010_CLKCTRL 1                         /*!< (unspecified)                                                        */
#define LRCCONF010_NACTPD_MIN 0                      /*!< (unspecified)                                                        */
#define LRCCONF010_NACTPD_MAX 0                      /*!< (unspecified)                                                        */
#define LRCCONF010_NACTPD_SIZE 1                     /*!< (unspecified)                                                        */
#define LRCCONF010_PDACT 1                           /*!< (unspecified)                                                        */
#define LRCCONF010_NPD_MIN 0                         /*!< (unspecified)                                                        */
#define LRCCONF010_NPD_MAX 7                         /*!< (unspecified)                                                        */
#define LRCCONF010_NPD_SIZE 8                        /*!< (unspecified)                                                        */
#define LRCCONF010_OTHERON 0                         /*!< (unspecified)                                                        */
#define LRCCONF010_NDOMAINS_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF010_NDOMAINS_MAX 15                   /*!< (unspecified)                                                        */
#define LRCCONF010_NDOMAINS_SIZE 16                  /*!< (unspecified)                                                        */
#define LRCCONF010_AX2XWAITSTATES 0                  /*!< (unspecified)                                                        */
#define LRCCONF010_POWERON_MAIN_RESET 0              /*!< Reset value of register POWERON.MAIN: 0                              */
#define LRCCONF010_POWERON_ACT_RESET 0               /*!< Reset value of register POWERON.ACT: 0                               */
#define LRCCONF010_RETAIN_MAIN_RESET 1               /*!< Reset value of register RETAIN.MAIN: 1                               */
#define LRCCONF010_RETAIN_ACT_RESET 1                /*!< Reset value of register RETAIN.ACT: 1                                */

#define LRCCONF300_POWERON 1                         /*!< (unspecified)                                                        */
#define LRCCONF300_RETAIN 1                          /*!< (unspecified)                                                        */
#define LRCCONF300_SYSTEMOFF 1                       /*!< (unspecified)                                                        */
#define LRCCONF300_LRCREQHFXO 0                      /*!< (unspecified)                                                        */
#define LRCCONF300_NCLK_MIN 0                        /*!< (unspecified)                                                        */
#define LRCCONF300_NCLK_MAX 7                        /*!< (unspecified)                                                        */
#define LRCCONF300_NCLK_SIZE 8                       /*!< (unspecified)                                                        */
#define LRCCONF300_CLKCTRL 0                         /*!< (unspecified)                                                        */
#define LRCCONF300_NACTPD_MIN 0                      /*!< (unspecified)                                                        */
#define LRCCONF300_NACTPD_MAX 0                      /*!< (unspecified)                                                        */
#define LRCCONF300_NACTPD_SIZE 1                     /*!< (unspecified)                                                        */
#define LRCCONF300_PDACT 1                           /*!< (unspecified)                                                        */
#define LRCCONF300_NPD_MIN 0                         /*!< (unspecified)                                                        */
#define LRCCONF300_NPD_MAX 7                         /*!< (unspecified)                                                        */
#define LRCCONF300_NPD_SIZE 8                        /*!< (unspecified)                                                        */
#define LRCCONF300_OTHERON 0                         /*!< (unspecified)                                                        */
#define LRCCONF300_NDOMAINS_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF300_NDOMAINS_MAX 15                   /*!< (unspecified)                                                        */
#define LRCCONF300_NDOMAINS_SIZE 16                  /*!< (unspecified)                                                        */
#define LRCCONF300_AX2XWAITSTATES 0                  /*!< (unspecified)                                                        */
#define LRCCONF300_POWERON_MAIN_RESET 0              /*!< Reset value of register POWERON.MAIN: 0                              */
#define LRCCONF300_POWERON_ACT_RESET 0               /*!< Reset value of register POWERON.ACT: 0                               */
#define LRCCONF300_RETAIN_MAIN_RESET 1               /*!< Reset value of register RETAIN.MAIN: 1                               */
#define LRCCONF300_RETAIN_ACT_RESET 1                /*!< Reset value of register RETAIN.ACT: 1                                */

#define LRCCONF310_POWERON 1                         /*!< (unspecified)                                                        */
#define LRCCONF310_RETAIN 1                          /*!< (unspecified)                                                        */
#define LRCCONF310_SYSTEMOFF 1                       /*!< (unspecified)                                                        */
#define LRCCONF310_LRCREQHFXO 1                      /*!< (unspecified)                                                        */
#define LRCCONF310_NCLK_MIN 0                        /*!< (unspecified)                                                        */
#define LRCCONF310_NCLK_MAX 0                        /*!< (unspecified)                                                        */
#define LRCCONF310_NCLK_SIZE 1                       /*!< (unspecified)                                                        */
#define LRCCONF310_CLKCTRL 1                         /*!< (unspecified)                                                        */
#define LRCCONF310_NACTPD_MIN 0                      /*!< (unspecified)                                                        */
#define LRCCONF310_NACTPD_MAX 0                      /*!< (unspecified)                                                        */
#define LRCCONF310_NACTPD_SIZE 1                     /*!< (unspecified)                                                        */
#define LRCCONF310_PDACT 1                           /*!< (unspecified)                                                        */
#define LRCCONF310_NPD_MIN 0                         /*!< (unspecified)                                                        */
#define LRCCONF310_NPD_MAX 7                         /*!< (unspecified)                                                        */
#define LRCCONF310_NPD_SIZE 8                        /*!< (unspecified)                                                        */
#define LRCCONF310_OTHERON 0                         /*!< (unspecified)                                                        */
#define LRCCONF310_NDOMAINS_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF310_NDOMAINS_MAX 15                   /*!< (unspecified)                                                        */
#define LRCCONF310_NDOMAINS_SIZE 16                  /*!< (unspecified)                                                        */
#define LRCCONF310_AX2XWAITSTATES 0                  /*!< (unspecified)                                                        */
#define LRCCONF310_POWERON_MAIN_RESET 0              /*!< Reset value of register POWERON.MAIN: 0                              */
#define LRCCONF310_POWERON_ACT_RESET 0               /*!< Reset value of register POWERON.ACT: 0                               */
#define LRCCONF310_RETAIN_MAIN_RESET 1               /*!< Reset value of register RETAIN.MAIN: 1                               */
#define LRCCONF310_RETAIN_ACT_RESET 1                /*!< Reset value of register RETAIN.ACT: 1                                */

#define LRCCONF_SDCARD_POWERON 1                     /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_RETAIN 1                      /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_SYSTEMOFF 1                   /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_LRCREQHFXO 0                  /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NCLK_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NCLK_MAX 7                    /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NCLK_SIZE 8                   /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_CLKCTRL 0                     /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NACTPD_MIN 0                  /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NACTPD_MAX 0                  /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NACTPD_SIZE 1                 /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_PDACT 1                       /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NPD_MIN 0                     /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NPD_MAX 7                     /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NPD_SIZE 8                    /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_OTHERON 0                     /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NDOMAINS_MIN 0                /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NDOMAINS_MAX 15               /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NDOMAINS_SIZE 16              /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_AX2XWAITSTATES 0              /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_POWERON_MAIN_RESET 0          /*!< Reset value of register POWERON.MAIN: 0                              */
#define LRCCONF_SDCARD_POWERON_ACT_RESET 0           /*!< Reset value of register POWERON.ACT: 0                               */
#define LRCCONF_SDCARD_RETAIN_MAIN_RESET 1           /*!< Reset value of register RETAIN.MAIN: 1                               */
#define LRCCONF_SDCARD_RETAIN_ACT_RESET 1            /*!< Reset value of register RETAIN.ACT: 1                                */

/*CPU Configuration*/
#define CPUCONF_PRESENT 1
#define CPUCONF_COUNT 1

