ankuns/nrfx/bsp/stable/mdk/nrf7140_secure_peripherals.h
/*ATB Replicator module*/
#define ATBREPLICATOR_PRESENT 1
#define ATBREPLICATOR_COUNT 4

/*ATB funnel module*/
#define ATBFUNNEL_PRESENT 1
#define ATBFUNNEL_COUNT 4

/*AUXPLL*/
#define AUXPLL_PRESENT 1
#define AUXPLL_COUNT 4

/*AUXPM*/
#define AUXPM_PRESENT 1
#define AUXPM_COUNT 3

/*VREGVS0V8 peripheral*/
#define VREGVS0V8_PRESENT 1
#define VREGVS0V8_COUNT 1

#define VREGGFX_INCLUDE_PCGCS 1                      /*!< (unspecified)                                                        */
#define VREGGFX_VREGVS0V8_NUM_CLOCK_POWER_PAIR_MIN 0 /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..2]*/
#define VREGGFX_VREGVS0V8_NUM_CLOCK_POWER_PAIR_MAX 2 /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..2]*/
#define VREGGFX_VREGVS0V8_NUM_CLOCK_POWER_PAIR_SIZE 3 /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                           [0..2]*/
#define VREGGFX_VREGVS0V8_NOTFULLPCPZERO 0           /*!< (unspecified)                                                        */
#define VREGGFX_HIGHER_CURRENT_LIMIT 1               /*!< (unspecified)                                                        */
#define VREGGFX_ADD_HP_HELPER_MODE 1                 /*!< (unspecified)                                                        */

/*GPIO Tasks and Events*/
#define GPIOTE_PRESENT 1
#define GPIOTE_COUNT 1

#define GPIOTE130_IRQ_COUNT 2
#define GPIOTE130_GPIOTE_NCHANNELS_MIN 0             /*!< Number of GPIOTE channels: 0..7                                      */
#define GPIOTE130_GPIOTE_NCHANNELS_MAX 7             /*!< Number of GPIOTE channels: 0..7                                      */
#define GPIOTE130_GPIOTE_NCHANNELS_SIZE 8            /*!< Number of GPIOTE channels: 0..7                                      */
#define GPIOTE130_GPIOTE_NPORTEVENTS_MIN 0           /*!< Number of GPIOTE port events: 0..3                                   */
#define GPIOTE130_GPIOTE_NPORTEVENTS_MAX 3           /*!< Number of GPIOTE port events: 0..3                                   */
#define GPIOTE130_GPIOTE_NPORTEVENTS_SIZE 4          /*!< Number of GPIOTE port events: 0..3                                   */
#define GPIOTE130_GPIOTE_NINTERRUPTS_MIN 0           /*!< Number of GPIOTE interrupts: 0..1                                    */
#define GPIOTE130_GPIOTE_NINTERRUPTS_MAX 1           /*!< Number of GPIOTE interrupts: 0..1                                    */
#define GPIOTE130_GPIOTE_NINTERRUPTS_SIZE 2          /*!< Number of GPIOTE interrupts: 0..1                                    */
#define GPIOTE130_HAS_PORT_EVENT 1                   /*!< (unspecified)                                                        */

/*Global Real-time counter*/
#define GRTC_PRESENT 1
#define GRTC_COUNT 1

#define GRTC_IRQ_COUNT 3
#define GRTC_MSBWIDTH_MIN 0                          /*!< Width of the RTCOUNTERH, RTCOMPAREH and RTCOMPARESYNCH registers :
                                                          0..14*/
#define GRTC_MSBWIDTH_MAX 14                         /*!< Width of the RTCOUNTERH, RTCOMPAREH and RTCOMPARESYNCH registers :
                                                          0..14*/
#define GRTC_MSBWIDTH_SIZE 15                        /*!< Width of the RTCOUNTERH, RTCOMPAREH and RTCOMPARESYNCH registers :
                                                          0..14*/
#define GRTC_NCC_MIN 0                               /*!< Number of compare/capture registers : 0..18                          */
#define GRTC_NCC_MAX 18                              /*!< Number of compare/capture registers : 0..18                          */
#define GRTC_NCC_SIZE 19                             /*!< Number of compare/capture registers : 0..18                          */
#define GRTC_NTIMEOUT_MIN 0                          /*!< Width of the TIMEOUT register : 0..15                                */
#define GRTC_NTIMEOUT_MAX 15                         /*!< Width of the TIMEOUT register : 0..15                                */
#define GRTC_NTIMEOUT_SIZE 16                        /*!< Width of the TIMEOUT register : 0..15                                */
#define GRTC_NDOMAIN_MIN 0                           /*!< Number of domains at the KEEPRUNNING register: 0..15                 */
#define GRTC_NDOMAIN_MAX 15                          /*!< Number of domains at the KEEPRUNNING register: 0..15                 */
#define GRTC_NDOMAIN_SIZE 16                         /*!< Number of domains at the KEEPRUNNING register: 0..15                 */
#define GRTC_GRTC_NINTERRUPTS_MIN 0                  /*!< Number of GRTC interrupts : 0..2                                     */
#define GRTC_GRTC_NINTERRUPTS_MAX 2                  /*!< Number of GRTC interrupts : 0..2                                     */
#define GRTC_GRTC_NINTERRUPTS_SIZE 3                 /*!< Number of GRTC interrupts : 0..2                                     */
#define GRTC_PWMREGS 1                               /*!< (unspecified)                                                        */
#define GRTC_CLKOUTREG 1                             /*!< (unspecified)                                                        */
#define GRTC_CLKSELREG 1                             /*!< (unspecified)                                                        */
#define GRTC_CLKSELLFLPRC 1                          /*!< (unspecified)                                                        */
#define GRTC_CCADD_WRITE_ONLY 1                      /*!< (unspecified)                                                        */
#define GRTC_READY_STATUS_AND_EVENTS 0               /*!< (unspecified)                                                        */

/*GSI*/
#define GSI_PRESENT 1
#define GSI_COUNT 1

#define GSI_GSI_NUM_CLOCK_POWER_PAIR_MIN 0           /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define GSI_GSI_NUM_CLOCK_POWER_PAIR_MAX 1           /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define GSI_GSI_NUM_CLOCK_POWER_PAIR_SIZE 2          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define GSI_GSI_NOTFULLPCPZERO 1                     /*!< (unspecified)                                                        */
#define GSI_FPGA 0                                   /*!< (unspecified)                                                        */

/*DISPC*/
#define DISPC_PRESENT 1
#define DISPC_COUNT 1

#define DISPC_IRQ_COUNT 3
#define DISPC_DISPC_NUM_CLOCK_POWER_PAIR_MIN 0       /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define DISPC_DISPC_NUM_CLOCK_POWER_PAIR_MAX 1       /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define DISPC_DISPC_NUM_CLOCK_POWER_PAIR_SIZE 2      /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define DISPC_DISPC_NOTFULLPCPZERO 1                 /*!< (unspecified)                                                        */

/*GPU*/
#define GPU_PRESENT 1
#define GPU_COUNT 1

#define GPU_GPU_NUM_CLOCK_POWER_PAIR_MIN 0           /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define GPU_GPU_NUM_CLOCK_POWER_PAIR_MAX 1           /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define GPU_GPU_NUM_CLOCK_POWER_PAIR_SIZE 2          /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define GPU_GPU_NOTFULLPCPZERO 1                     /*!< (unspecified)                                                        */

/*Trace buffer monitor*/
#define TBM_PRESENT 1
#define TBM_COUNT 1

