ankuns/nrfx/bsp/stable/mdk/nrf7140_secure_peripherals.h
#define GPIOINTERNAL_TURNOFFAUTOCLOCKSOURCEREQ 1     /*!< (unspecified)                                                        */
#define GPIOINTERNAL_POWERFORCINGPRE 1               /*!< (unspecified)                                                        */
#define GPIOINTERNAL_DOFORCEPOWERPRE 1               /*!< (unspecified)                                                        */
#define GPIOINTERNAL_PENALTYBITS_MIN 0               /*!< (unspecified)                                                        */
#define GPIOINTERNAL_PENALTYBITS_MAX 7               /*!< (unspecified)                                                        */
#define GPIOINTERNAL_PENALTYBITS_SIZE 8              /*!< (unspecified)                                                        */

/*Reset hub*/
#define RESETHUB_PRESENT 1
#define RESETHUB_COUNT 1

#define RESETHUB_DOMAIN_MASK 2044                    /*!< Mask for supported domains.                                          */
#define RESETHUB_CROSSDOMAINRESET 0                  /*!< (unspecified)                                                        */

/*VREGUSB peripheral*/
#define VREGUSB_PRESENT 1
#define VREGUSB_COUNT 1

#define VREGUSB_PROLONGED_WAKEUP 1                   /*!< (unspecified)                                                        */

/*Analog to Digital Converter*/
#define SAADC_PRESENT 1
#define SAADC_COUNT 1

#define SAADC_EASYDMA5 0                             /*!< (unspecified)                                                        */
#define SAADC_EASYDMATEMP 1                          /*!< (unspecified)                                                        */
#define SAADC_PSEL_V2 1                              /*!< (unspecified)                                                        */
#define SAADC_TASKS_CALIBRATEGAIN 1                  /*!< (unspecified)                                                        */
#define SAADC_PADC_TSMC22 0                          /*!< (unspecified)                                                        */
#define SAADC_SAMPLERATE_CC_VALUERANGE_MIN 4         /*!< (unspecified)                                                        */
#define SAADC_SAMPLERATE_CC_VALUERANGE_MAX 2047      /*!< (unspecified)                                                        */
#define SAADC_SAMPLERATE_CC_VALUERANGE_SIZE 2048     /*!< (unspecified)                                                        */
#define SAADC_TACQ_VALUE_RANGE_MIN 0                 /*!< (unspecified)                                                        */
#define SAADC_TACQ_VALUE_RANGE_MAX 319               /*!< (unspecified)                                                        */
#define SAADC_TACQ_VALUE_RANGE_SIZE 320              /*!< (unspecified)                                                        */
#define SAADC_TCONV_VALUE_RANGE_MIN 0                /*!< (unspecified)                                                        */
#define SAADC_TCONV_VALUE_RANGE_MAX 7                /*!< (unspecified)                                                        */
#define SAADC_TCONV_VALUE_RANGE_SIZE 8               /*!< (unspecified)                                                        */
#define SAADC_EASYDMALISTINCLUDED 0                  /*!< (unspecified)                                                        */
#define SAADC_EASYDMAMODEINCLUDED 0                  /*!< (unspecified)                                                        */
#define SAADC_EASYDMAFULLLPMODEINCLUDED 0            /*!< (unspecified)                                                        */
#define SAADC_EASYDMAPATTERNMATCHERINCLUDED 0        /*!< (unspecified)                                                        */
#define SAADC_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                    */
#define SAADC_EASYDMASTOPTASKINCLUDED 1              /*!< (unspecified)                                                        */

/*Comparator*/
#define COMP_PRESENT 1
#define COMP_COUNT 1

#define COMP_GF22N 1                                 /*!< (unspecified)                                                        */
#define COMP_TSMC22N 0                               /*!< (unspecified)                                                        */

/*Low-power comparator*/
#define LPCOMP_PRESENT 1
#define LPCOMP_COUNT 1

#define LPCOMP_GF22N 1                               /*!< (unspecified)                                                        */
#define LPCOMP_TSMC22N 0                             /*!< (unspecified)                                                        */
#define LPCOMP_RETAIN 1                              /*!< (unspecified)                                                        */
#define LPCOMP_POWER 0                               /*!< (unspecified)                                                        */

/*Temperature Sensor*/
#define TEMP_PRESENT 1
#define TEMP_COUNT 1

#define TEMP_HAS_ATBCONFIG 1                         /*!< (unspecified)                                                        */
#define TEMP_HAS_OVERRIDEPWR 0                       /*!< (unspecified)                                                        */

/*NFC-A compatible radio NFC-A compatible radio*/
#define NFCT_PRESENT 1
#define NFCT_COUNT 1

#define NFCT_EASYDMA5 0                              /*!< (unspecified)                                                        */
#define NFCT_EASYDMATEMP 1                           /*!< (unspecified)                                                        */
#define NFCT_BUSERROR_PRESENT 0                      /*!< (unspecified)                                                        */
#define NFCT_NFCTFIELDDETCFG_RESET 1                 /*!< Reset value of register NFCTFIELDDETCFG: 1                           */

/*Time division multiplexed audio interface*/
#define TDM_PRESENT 1
#define TDM_COUNT 3

#define TDM130_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define TDM130_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define TDM130_NUM_CHANNELS_MIN 0                    /*!< (unspecified)                                                        */
#define TDM130_NUM_CHANNELS_MAX 7                    /*!< (unspecified)                                                        */
#define TDM130_NUM_CHANNELS_SIZE 8                   /*!< (unspecified)                                                        */
#define TDM130_TDM_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by TDM instance of PCGC Slave -
                                                          [0..3]*/
#define TDM130_TDM_NUM_CLOCK_POWER_PAIR_MAX 3        /*!< Number of clock/power pairs used by TDM instance of PCGC Slave -
                                                          [0..3]*/
#define TDM130_TDM_NUM_CLOCK_POWER_PAIR_SIZE 4       /*!< Number of clock/power pairs used by TDM instance of PCGC Slave -
                                                          [0..3]*/
#define TDM130_TDM_NOTFULLPCPZERO 1                  /*!< (unspecified)                                                        */
#define TDM130_BRGMCK_NUM_CLOCK_POWER_PAIR_MIN 0     /*!< Number of clock/power pairs used by BRGMCK instance of PCGC Slave -
                                                          [brgmck_numpcp]*/
#define TDM130_BRGMCK_NUM_CLOCK_POWER_PAIR_MAX 2     /*!< Number of clock/power pairs used by BRGMCK instance of PCGC Slave -
                                                          [brgmck_numpcp]*/
#define TDM130_BRGMCK_NUM_CLOCK_POWER_PAIR_SIZE 3    /*!< Number of clock/power pairs used by BRGMCK instance of PCGC Slave -
                                                          [brgmck_numpcp]*/
#define TDM130_BRGMCK_NOTFULLPCPZERO 1               /*!< (unspecified)                                                        */
#define TDM130_BRGSCK_NUM_CLOCK_POWER_PAIR_MIN 0     /*!< Number of clock/power pairs used by BRGSCK instance of PCGC Slave -
                                                          [brgsck_numpcp]*/
#define TDM130_BRGSCK_NUM_CLOCK_POWER_PAIR_MAX 2     /*!< Number of clock/power pairs used by BRGSCK instance of PCGC Slave -
                                                          [brgsck_numpcp]*/
#define TDM130_BRGSCK_NUM_CLOCK_POWER_PAIR_SIZE 3    /*!< Number of clock/power pairs used by BRGSCK instance of PCGC Slave -
                                                          [brgsck_numpcp]*/
#define TDM130_BRGSCK_NOTFULLPCPZERO 1               /*!< (unspecified)                                                        */
#define TDM130_DMARX_NUM_CLOCK_POWER_PAIR_MIN 0      /*!< Number of clock/power pairs used by DMARX instance of PCGC Slave -
                                                          [dmarx_numpcp]*/
#define TDM130_DMARX_NUM_CLOCK_POWER_PAIR_MAX 1      /*!< Number of clock/power pairs used by DMARX instance of PCGC Slave -
                                                          [dmarx_numpcp]*/
#define TDM130_DMARX_NUM_CLOCK_POWER_PAIR_SIZE 2     /*!< Number of clock/power pairs used by DMARX instance of PCGC Slave -
                                                          [dmarx_numpcp]*/
#define TDM130_DMARX_NOTFULLPCPZERO 1                /*!< (unspecified)                                                        */
#define TDM130_DMATX_NUM_CLOCK_POWER_PAIR_MIN 0      /*!< Number of clock/power pairs used by DMATX instance of PCGC Slave -
                                                          [dmatx_numpcp]*/
#define TDM130_DMATX_NUM_CLOCK_POWER_PAIR_MAX 1      /*!< Number of clock/power pairs used by DMATX instance of PCGC Slave -
                                                          [dmatx_numpcp]*/
#define TDM130_DMATX_NUM_CLOCK_POWER_PAIR_SIZE 2     /*!< Number of clock/power pairs used by DMATX instance of PCGC Slave -
                                                          [dmatx_numpcp]*/
#define TDM130_DMATX_NOTFULLPCPZERO 1                /*!< (unspecified)                                                        */
#define TDM130_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define TDM130_EASYDMAMODEINCLUDED 1                 /*!< (unspecified)                                                        */
#define TDM130_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define TDM130_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define TDM130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define TDM130_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define TDM131_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define TDM131_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define TDM131_NUM_CHANNELS_MIN 0                    /*!< (unspecified)                                                        */
#define TDM131_NUM_CHANNELS_MAX 7                    /*!< (unspecified)                                                        */
#define TDM131_NUM_CHANNELS_SIZE 8                   /*!< (unspecified)                                                        */
#define TDM131_TDM_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by TDM instance of PCGC Slave -
                                                          [0..3]*/
#define TDM131_TDM_NUM_CLOCK_POWER_PAIR_MAX 3        /*!< Number of clock/power pairs used by TDM instance of PCGC Slave -
                                                          [0..3]*/
#define TDM131_TDM_NUM_CLOCK_POWER_PAIR_SIZE 4       /*!< Number of clock/power pairs used by TDM instance of PCGC Slave -
                                                          [0..3]*/
#define TDM131_TDM_NOTFULLPCPZERO 1                  /*!< (unspecified)                                                        */
#define TDM131_BRGMCK_NUM_CLOCK_POWER_PAIR_MIN 0     /*!< Number of clock/power pairs used by BRGMCK instance of PCGC Slave -
                                                          [brgmck_numpcp]*/
#define TDM131_BRGMCK_NUM_CLOCK_POWER_PAIR_MAX 2     /*!< Number of clock/power pairs used by BRGMCK instance of PCGC Slave -
                                                          [brgmck_numpcp]*/
#define TDM131_BRGMCK_NUM_CLOCK_POWER_PAIR_SIZE 3    /*!< Number of clock/power pairs used by BRGMCK instance of PCGC Slave -
                                                          [brgmck_numpcp]*/
#define TDM131_BRGMCK_NOTFULLPCPZERO 1               /*!< (unspecified)                                                        */
#define TDM131_BRGSCK_NUM_CLOCK_POWER_PAIR_MIN 0     /*!< Number of clock/power pairs used by BRGSCK instance of PCGC Slave -
                                                          [brgsck_numpcp]*/
#define TDM131_BRGSCK_NUM_CLOCK_POWER_PAIR_MAX 2     /*!< Number of clock/power pairs used by BRGSCK instance of PCGC Slave -
                                                          [brgsck_numpcp]*/
#define TDM131_BRGSCK_NUM_CLOCK_POWER_PAIR_SIZE 3    /*!< Number of clock/power pairs used by BRGSCK instance of PCGC Slave -
                                                          [brgsck_numpcp]*/
#define TDM131_BRGSCK_NOTFULLPCPZERO 1               /*!< (unspecified)                                                        */
#define TDM131_DMARX_NUM_CLOCK_POWER_PAIR_MIN 0      /*!< Number of clock/power pairs used by DMARX instance of PCGC Slave -
                                                          [dmarx_numpcp]*/
#define TDM131_DMARX_NUM_CLOCK_POWER_PAIR_MAX 1      /*!< Number of clock/power pairs used by DMARX instance of PCGC Slave -
                                                          [dmarx_numpcp]*/
#define TDM131_DMARX_NUM_CLOCK_POWER_PAIR_SIZE 2     /*!< Number of clock/power pairs used by DMARX instance of PCGC Slave -
                                                          [dmarx_numpcp]*/
#define TDM131_DMARX_NOTFULLPCPZERO 1                /*!< (unspecified)                                                        */
#define TDM131_DMATX_NUM_CLOCK_POWER_PAIR_MIN 0      /*!< Number of clock/power pairs used by DMATX instance of PCGC Slave -
                                                          [dmatx_numpcp]*/
#define TDM131_DMATX_NUM_CLOCK_POWER_PAIR_MAX 1      /*!< Number of clock/power pairs used by DMATX instance of PCGC Slave -
                                                          [dmatx_numpcp]*/
#define TDM131_DMATX_NUM_CLOCK_POWER_PAIR_SIZE 2     /*!< Number of clock/power pairs used by DMATX instance of PCGC Slave -
                                                          [dmatx_numpcp]*/
#define TDM131_DMATX_NOTFULLPCPZERO 1                /*!< (unspecified)                                                        */
#define TDM131_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define TDM131_EASYDMAMODEINCLUDED 1                 /*!< (unspecified)                                                        */
#define TDM131_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define TDM131_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define TDM131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define TDM131_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define TDM132_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define TDM132_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define TDM132_NUM_CHANNELS_MIN 0                    /*!< (unspecified)                                                        */
#define TDM132_NUM_CHANNELS_MAX 7                    /*!< (unspecified)                                                        */
#define TDM132_NUM_CHANNELS_SIZE 8                   /*!< (unspecified)                                                        */
#define TDM132_TDM_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by TDM instance of PCGC Slave -
                                                          [0..3]*/
#define TDM132_TDM_NUM_CLOCK_POWER_PAIR_MAX 3        /*!< Number of clock/power pairs used by TDM instance of PCGC Slave -
                                                          [0..3]*/
#define TDM132_TDM_NUM_CLOCK_POWER_PAIR_SIZE 4       /*!< Number of clock/power pairs used by TDM instance of PCGC Slave -
                                                          [0..3]*/
#define TDM132_TDM_NOTFULLPCPZERO 1                  /*!< (unspecified)                                                        */
#define TDM132_BRGMCK_NUM_CLOCK_POWER_PAIR_MIN 0     /*!< Number of clock/power pairs used by BRGMCK instance of PCGC Slave -
                                                          [brgmck_numpcp]*/
#define TDM132_BRGMCK_NUM_CLOCK_POWER_PAIR_MAX 2     /*!< Number of clock/power pairs used by BRGMCK instance of PCGC Slave -
                                                          [brgmck_numpcp]*/
#define TDM132_BRGMCK_NUM_CLOCK_POWER_PAIR_SIZE 3    /*!< Number of clock/power pairs used by BRGMCK instance of PCGC Slave -
                                                          [brgmck_numpcp]*/
#define TDM132_BRGMCK_NOTFULLPCPZERO 1               /*!< (unspecified)                                                        */
#define TDM132_BRGSCK_NUM_CLOCK_POWER_PAIR_MIN 0     /*!< Number of clock/power pairs used by BRGSCK instance of PCGC Slave -
                                                          [brgsck_numpcp]*/
#define TDM132_BRGSCK_NUM_CLOCK_POWER_PAIR_MAX 2     /*!< Number of clock/power pairs used by BRGSCK instance of PCGC Slave -
                                                          [brgsck_numpcp]*/
#define TDM132_BRGSCK_NUM_CLOCK_POWER_PAIR_SIZE 3    /*!< Number of clock/power pairs used by BRGSCK instance of PCGC Slave -
                                                          [brgsck_numpcp]*/
#define TDM132_BRGSCK_NOTFULLPCPZERO 1               /*!< (unspecified)                                                        */
#define TDM132_DMARX_NUM_CLOCK_POWER_PAIR_MIN 0      /*!< Number of clock/power pairs used by DMARX instance of PCGC Slave -
                                                          [dmarx_numpcp]*/
#define TDM132_DMARX_NUM_CLOCK_POWER_PAIR_MAX 1      /*!< Number of clock/power pairs used by DMARX instance of PCGC Slave -
                                                          [dmarx_numpcp]*/
#define TDM132_DMARX_NUM_CLOCK_POWER_PAIR_SIZE 2     /*!< Number of clock/power pairs used by DMARX instance of PCGC Slave -
                                                          [dmarx_numpcp]*/
#define TDM132_DMARX_NOTFULLPCPZERO 1                /*!< (unspecified)                                                        */
#define TDM132_DMATX_NUM_CLOCK_POWER_PAIR_MIN 0      /*!< Number of clock/power pairs used by DMATX instance of PCGC Slave -
                                                          [dmatx_numpcp]*/
#define TDM132_DMATX_NUM_CLOCK_POWER_PAIR_MAX 1      /*!< Number of clock/power pairs used by DMATX instance of PCGC Slave -
                                                          [dmatx_numpcp]*/
#define TDM132_DMATX_NUM_CLOCK_POWER_PAIR_SIZE 2     /*!< Number of clock/power pairs used by DMATX instance of PCGC Slave -
                                                          [dmatx_numpcp]*/
#define TDM132_DMATX_NOTFULLPCPZERO 1                /*!< (unspecified)                                                        */
#define TDM132_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define TDM132_EASYDMAMODEINCLUDED 1                 /*!< (unspecified)                                                        */
#define TDM132_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define TDM132_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define TDM132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define TDM132_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

