ankuns/nrfx/bsp/stable/mdk/nrf7140_secure_peripherals.h
/* ============================================= SPU111 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU111.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_TASKS_0 = 0, /*!< Index of access permissions for task pair [1:0] of BELLBOARD     */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_TASKS_1 = 1, /*!< Index of access permissions for task pair [3:2] of BELLBOARD     */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_TASKS_2 = 2, /*!< Index of access permissions for task pair [5:4] of BELLBOARD     */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_TASKS_3 = 3, /*!< Index of access permissions for task pair [7:6] of BELLBOARD     */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_TASKS_4 = 4, /*!< Index of access permissions for task pair [9:8] of BELLBOARD     */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_TASKS_5 = 5, /*!< Index of access permissions for task pair [11:10] of BELLBOARD   */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_TASKS_6 = 6, /*!< Index of access permissions for task pair [13:12] of BELLBOARD   */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_TASKS_7 = 7, /*!< Index of access permissions for task pair [15:14] of BELLBOARD   */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_TASKS_8 = 8, /*!< Index of access permissions for task pair [17:16] of BELLBOARD   */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_TASKS_9 = 9, /*!< Index of access permissions for task pair [19:18] of BELLBOARD   */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_TASKS_10 = 10, /*!< Index of access permissions for task pair [21:20] of BELLBOARD */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_TASKS_11 = 11, /*!< Index of access permissions for task pair [23:22] of BELLBOARD */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_TASKS_12 = 12, /*!< Index of access permissions for task pair [25:24] of BELLBOARD */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_TASKS_13 = 13, /*!< Index of access permissions for task pair [27:26] of BELLBOARD */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_TASKS_14 = 14, /*!< Index of access permissions for task pair [29:28] of BELLBOARD */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_TASKS_15 = 15, /*!< Index of access permissions for task pair [31:30] of BELLBOARD */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_EVENTS_0 = 16, /*!< Index of access permissions for event pair [1:0] of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_EVENTS_1 = 17, /*!< Index of access permissions for event pair [3:2] of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_EVENTS_2 = 18, /*!< Index of access permissions for event pair [5:4] of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_EVENTS_3 = 19, /*!< Index of access permissions for event pair [7:6] of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_EVENTS_4 = 20, /*!< Index of access permissions for event pair [9:8] of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_EVENTS_5 = 21, /*!< Index of access permissions for event pair [11:10] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_EVENTS_6 = 22, /*!< Index of access permissions for event pair [13:12] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_EVENTS_7 = 23, /*!< Index of access permissions for event pair [15:14] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_EVENTS_8 = 24, /*!< Index of access permissions for event pair [17:16] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_EVENTS_9 = 25, /*!< Index of access permissions for event pair [19:18] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_EVENTS_10 = 26, /*!< Index of access permissions for event pair [21:20] of
                                                                 BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_EVENTS_11 = 27, /*!< Index of access permissions for event pair [23:22] of
                                                                 BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_EVENTS_12 = 28, /*!< Index of access permissions for event pair [25:24] of
                                                                 BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_EVENTS_13 = 29, /*!< Index of access permissions for event pair [27:26] of
                                                                 BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_EVENTS_14 = 30, /*!< Index of access permissions for event pair [29:28] of
                                                                 BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_EVENTS_15 = 31, /*!< Index of access permissions for event pair [31:30] of
                                                                 BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_INTERRUPT_0 = 32, /*!< Index of access permissions for interrupt 0 of BELLBOARD    */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_INTERRUPT_1 = 33, /*!< Index of access permissions for interrupt 1 of BELLBOARD    */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_INTERRUPT_2 = 34, /*!< Index of access permissions for interrupt 2 of BELLBOARD    */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_WIFI_INTERRUPT_3 = 35, /*!< Index of access permissions for interrupt 3 of BELLBOARD    */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_TASKS_0 = 48, /*!< Index of access permissions for task pair [1:0] of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_TASKS_1 = 49, /*!< Index of access permissions for task pair [3:2] of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_TASKS_2 = 50, /*!< Index of access permissions for task pair [5:4] of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_TASKS_3 = 51, /*!< Index of access permissions for task pair [7:6] of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_TASKS_4 = 52, /*!< Index of access permissions for task pair [9:8] of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_TASKS_5 = 53, /*!< Index of access permissions for task pair [11:10] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_TASKS_6 = 54, /*!< Index of access permissions for task pair [13:12] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_TASKS_7 = 55, /*!< Index of access permissions for task pair [15:14] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_TASKS_8 = 56, /*!< Index of access permissions for task pair [17:16] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_TASKS_9 = 57, /*!< Index of access permissions for task pair [19:18] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_TASKS_10 = 58, /*!< Index of access permissions for task pair [21:20] of
                                                                  BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_TASKS_11 = 59, /*!< Index of access permissions for task pair [23:22] of
                                                                  BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_TASKS_12 = 60, /*!< Index of access permissions for task pair [25:24] of
                                                                  BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_TASKS_13 = 61, /*!< Index of access permissions for task pair [27:26] of
                                                                  BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_TASKS_14 = 62, /*!< Index of access permissions for task pair [29:28] of
                                                                  BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_TASKS_15 = 63, /*!< Index of access permissions for task pair [31:30] of
                                                                  BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_EVENTS_0 = 64, /*!< Index of access permissions for event pair [1:0] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_EVENTS_1 = 65, /*!< Index of access permissions for event pair [3:2] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_EVENTS_2 = 66, /*!< Index of access permissions for event pair [5:4] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_EVENTS_3 = 67, /*!< Index of access permissions for event pair [7:6] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_EVENTS_4 = 68, /*!< Index of access permissions for event pair [9:8] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_EVENTS_5 = 69, /*!< Index of access permissions for event pair [11:10] of
                                                                  BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_EVENTS_6 = 70, /*!< Index of access permissions for event pair [13:12] of
                                                                  BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_EVENTS_7 = 71, /*!< Index of access permissions for event pair [15:14] of
                                                                  BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_EVENTS_8 = 72, /*!< Index of access permissions for event pair [17:16] of
                                                                  BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_EVENTS_9 = 73, /*!< Index of access permissions for event pair [19:18] of
                                                                  BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_EVENTS_10 = 74, /*!< Index of access permissions for event pair [21:20] of
                                                                   BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_EVENTS_11 = 75, /*!< Index of access permissions for event pair [23:22] of
                                                                   BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_EVENTS_12 = 76, /*!< Index of access permissions for event pair [25:24] of
                                                                   BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_EVENTS_13 = 77, /*!< Index of access permissions for event pair [27:26] of
                                                                   BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_EVENTS_14 = 78, /*!< Index of access permissions for event pair [29:28] of
                                                                   BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_EVENTS_15 = 79, /*!< Index of access permissions for event pair [31:30] of
                                                                   BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_INTERRUPT_0 = 80, /*!< Index of access permissions for interrupt 0 of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_INTERRUPT_1 = 81, /*!< Index of access permissions for interrupt 1 of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_INTERRUPT_2 = 82, /*!< Index of access permissions for interrupt 2 of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_SECURE_INTERRUPT_3 = 83, /*!< Index of access permissions for interrupt 3 of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_TASKS_0 = 96, /*!< Index of access permissions for task pair [1:0] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_TASKS_1 = 97, /*!< Index of access permissions for task pair [3:2] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_TASKS_2 = 98, /*!< Index of access permissions for task pair [5:4] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_TASKS_3 = 99, /*!< Index of access permissions for task pair [7:6] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_TASKS_4 = 100, /*!< Index of access permissions for task pair [9:8] of
                                                                       BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_TASKS_5 = 101, /*!< Index of access permissions for task pair [11:10] of
                                                                       BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_TASKS_6 = 102, /*!< Index of access permissions for task pair [13:12] of
                                                                       BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_TASKS_7 = 103, /*!< Index of access permissions for task pair [15:14] of
                                                                       BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_TASKS_8 = 104, /*!< Index of access permissions for task pair [17:16] of
                                                                       BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_TASKS_9 = 105, /*!< Index of access permissions for task pair [19:18] of
                                                                       BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_TASKS_10 = 106, /*!< Index of access permissions for task pair [21:20] of
                                                                        BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_TASKS_11 = 107, /*!< Index of access permissions for task pair [23:22] of
                                                                        BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_TASKS_12 = 108, /*!< Index of access permissions for task pair [25:24] of
                                                                        BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_TASKS_13 = 109, /*!< Index of access permissions for task pair [27:26] of
                                                                        BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_TASKS_14 = 110, /*!< Index of access permissions for task pair [29:28] of
                                                                        BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_TASKS_15 = 111, /*!< Index of access permissions for task pair [31:30] of
                                                                        BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_EVENTS_0 = 112, /*!< Index of access permissions for event pair [1:0] of
                                                                        BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_EVENTS_1 = 113, /*!< Index of access permissions for event pair [3:2] of
                                                                        BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_EVENTS_2 = 114, /*!< Index of access permissions for event pair [5:4] of
                                                                        BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_EVENTS_3 = 115, /*!< Index of access permissions for event pair [7:6] of
                                                                        BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_EVENTS_4 = 116, /*!< Index of access permissions for event pair [9:8] of
                                                                        BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_EVENTS_5 = 117, /*!< Index of access permissions for event pair [11:10] of
                                                                        BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_EVENTS_6 = 118, /*!< Index of access permissions for event pair [13:12] of
                                                                        BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_EVENTS_7 = 119, /*!< Index of access permissions for event pair [15:14] of
                                                                        BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_EVENTS_8 = 120, /*!< Index of access permissions for event pair [17:16] of
                                                                        BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_EVENTS_9 = 121, /*!< Index of access permissions for event pair [19:18] of
                                                                        BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_EVENTS_10 = 122, /*!< Index of access permissions for event pair [21:20] of
                                                                         BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_EVENTS_11 = 123, /*!< Index of access permissions for event pair [23:22] of
                                                                         BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_EVENTS_12 = 124, /*!< Index of access permissions for event pair [25:24] of
                                                                         BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_EVENTS_13 = 125, /*!< Index of access permissions for event pair [27:26] of
                                                                         BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_EVENTS_14 = 126, /*!< Index of access permissions for event pair [29:28] of
                                                                         BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_EVENTS_15 = 127, /*!< Index of access permissions for event pair [31:30] of
                                                                         BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_INTERRUPT_0 = 128, /*!< Index of access permissions for interrupt 0 of
                                                                           BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_INTERRUPT_1 = 129, /*!< Index of access permissions for interrupt 1 of
                                                                           BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_INTERRUPT_2 = 130, /*!< Index of access permissions for interrupt 2 of
                                                                           BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_APPLICATION_INTERRUPT_3 = 131, /*!< Index of access permissions for interrupt 3 of
                                                                           BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_TASKS_0 = 144, /*!< Index of access permissions for task pair [1:0] of
                                                                     BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_TASKS_1 = 145, /*!< Index of access permissions for task pair [3:2] of
                                                                     BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_TASKS_2 = 146, /*!< Index of access permissions for task pair [5:4] of
                                                                     BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_TASKS_3 = 147, /*!< Index of access permissions for task pair [7:6] of
                                                                     BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_TASKS_4 = 148, /*!< Index of access permissions for task pair [9:8] of
                                                                     BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_TASKS_5 = 149, /*!< Index of access permissions for task pair [11:10] of
                                                                     BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_TASKS_6 = 150, /*!< Index of access permissions for task pair [13:12] of
                                                                     BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_TASKS_7 = 151, /*!< Index of access permissions for task pair [15:14] of
                                                                     BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_TASKS_8 = 152, /*!< Index of access permissions for task pair [17:16] of
                                                                     BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_TASKS_9 = 153, /*!< Index of access permissions for task pair [19:18] of
                                                                     BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_TASKS_10 = 154, /*!< Index of access permissions for task pair [21:20] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_TASKS_11 = 155, /*!< Index of access permissions for task pair [23:22] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_TASKS_12 = 156, /*!< Index of access permissions for task pair [25:24] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_TASKS_13 = 157, /*!< Index of access permissions for task pair [27:26] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_TASKS_14 = 158, /*!< Index of access permissions for task pair [29:28] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_TASKS_15 = 159, /*!< Index of access permissions for task pair [31:30] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_EVENTS_0 = 160, /*!< Index of access permissions for event pair [1:0] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_EVENTS_1 = 161, /*!< Index of access permissions for event pair [3:2] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_EVENTS_2 = 162, /*!< Index of access permissions for event pair [5:4] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_EVENTS_3 = 163, /*!< Index of access permissions for event pair [7:6] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_EVENTS_4 = 164, /*!< Index of access permissions for event pair [9:8] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_EVENTS_5 = 165, /*!< Index of access permissions for event pair [11:10] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_EVENTS_6 = 166, /*!< Index of access permissions for event pair [13:12] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_EVENTS_7 = 167, /*!< Index of access permissions for event pair [15:14] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_EVENTS_8 = 168, /*!< Index of access permissions for event pair [17:16] of
                                                                      BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_EVENTS_9 = 169, /*!< Index of access permissions for event pair [19:18] of
                                                                      BELLBOARD*/
