ankuns/nrfx/bsp/stable/mdk/nrf7140_secure_peripherals.h
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_EVENTS_10 = 170, /*!< Index of access permissions for event pair [21:20] of
                                                                       BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_EVENTS_11 = 171, /*!< Index of access permissions for event pair [23:22] of
                                                                       BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_EVENTS_12 = 172, /*!< Index of access permissions for event pair [25:24] of
                                                                       BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_EVENTS_13 = 173, /*!< Index of access permissions for event pair [27:26] of
                                                                       BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_EVENTS_14 = 174, /*!< Index of access permissions for event pair [29:28] of
                                                                       BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_EVENTS_15 = 175, /*!< Index of access permissions for event pair [31:30] of
                                                                       BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_INTERRUPT_0 = 176, /*!< Index of access permissions for interrupt 0 of
                                                                         BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_INTERRUPT_1 = 177, /*!< Index of access permissions for interrupt 1 of
                                                                         BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_INTERRUPT_2 = 178, /*!< Index of access permissions for interrupt 2 of
                                                                         BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_RADIOCORE_INTERRUPT_3 = 179, /*!< Index of access permissions for interrupt 3 of
                                                                         BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_TASKS_0 = 192, /*!< Index of access permissions for task pair [1:0] of BELLBOARD     */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_TASKS_1 = 193, /*!< Index of access permissions for task pair [3:2] of BELLBOARD     */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_TASKS_2 = 194, /*!< Index of access permissions for task pair [5:4] of BELLBOARD     */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_TASKS_3 = 195, /*!< Index of access permissions for task pair [7:6] of BELLBOARD     */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_TASKS_4 = 196, /*!< Index of access permissions for task pair [9:8] of BELLBOARD     */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_TASKS_5 = 197, /*!< Index of access permissions for task pair [11:10] of BELLBOARD   */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_TASKS_6 = 198, /*!< Index of access permissions for task pair [13:12] of BELLBOARD   */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_TASKS_7 = 199, /*!< Index of access permissions for task pair [15:14] of BELLBOARD   */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_TASKS_8 = 200, /*!< Index of access permissions for task pair [17:16] of BELLBOARD   */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_TASKS_9 = 201, /*!< Index of access permissions for task pair [19:18] of BELLBOARD   */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_TASKS_10 = 202, /*!< Index of access permissions for task pair [21:20] of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_TASKS_11 = 203, /*!< Index of access permissions for task pair [23:22] of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_TASKS_12 = 204, /*!< Index of access permissions for task pair [25:24] of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_TASKS_13 = 205, /*!< Index of access permissions for task pair [27:26] of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_TASKS_14 = 206, /*!< Index of access permissions for task pair [29:28] of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_TASKS_15 = 207, /*!< Index of access permissions for task pair [31:30] of BELLBOARD  */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_EVENTS_0 = 208, /*!< Index of access permissions for event pair [1:0] of BELLBOARD   */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_EVENTS_1 = 209, /*!< Index of access permissions for event pair [3:2] of BELLBOARD   */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_EVENTS_2 = 210, /*!< Index of access permissions for event pair [5:4] of BELLBOARD   */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_EVENTS_3 = 211, /*!< Index of access permissions for event pair [7:6] of BELLBOARD   */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_EVENTS_4 = 212, /*!< Index of access permissions for event pair [9:8] of BELLBOARD   */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_EVENTS_5 = 213, /*!< Index of access permissions for event pair [11:10] of BELLBOARD */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_EVENTS_6 = 214, /*!< Index of access permissions for event pair [13:12] of BELLBOARD */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_EVENTS_7 = 215, /*!< Index of access permissions for event pair [15:14] of BELLBOARD */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_EVENTS_8 = 216, /*!< Index of access permissions for event pair [17:16] of BELLBOARD */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_EVENTS_9 = 217, /*!< Index of access permissions for event pair [19:18] of BELLBOARD */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_EVENTS_10 = 218, /*!< Index of access permissions for event pair [21:20] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_EVENTS_11 = 219, /*!< Index of access permissions for event pair [23:22] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_EVENTS_12 = 220, /*!< Index of access permissions for event pair [25:24] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_EVENTS_13 = 221, /*!< Index of access permissions for event pair [27:26] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_EVENTS_14 = 222, /*!< Index of access permissions for event pair [29:28] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_EVENTS_15 = 223, /*!< Index of access permissions for event pair [31:30] of BELLBOARD*/
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_INTERRUPT_0 = 224, /*!< Index of access permissions for interrupt 0 of BELLBOARD     */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_INTERRUPT_1 = 225, /*!< Index of access permissions for interrupt 1 of BELLBOARD     */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_INTERRUPT_2 = 226, /*!< Index of access permissions for interrupt 2 of BELLBOARD     */
  NRF_SECURE_SPU111_FEATURES_BELLBOARD_ML_INTERRUPT_3 = 227, /*!< Index of access permissions for interrupt 3 of BELLBOARD     */
  NRF_SECURE_SPU111_FEATURES_MRAMC110_WAITSTATES = 384, /*!< Index of access permissions for WAITSTATES register of MRAMC110   */
  NRF_SECURE_SPU111_FEATURES_MRAMC110_AUTODPOWERDOWN = 385, /*!< Index of access permissions for POWER.AUTOPOWERDOWN register of
                                                                 MRAMC110*/
  NRF_SECURE_SPU111_FEATURES_MRAMC110_READY  = 386,  /*!< Index of access permissions for READY/READYNEXT registers of MRAMC110*/
  NRF_SECURE_SPU111_FEATURES_MRAMC111_WAITSTATES = 387, /*!< Index of access permissions for WAITSTATES register of MRAMC111   */
  NRF_SECURE_SPU111_FEATURES_MRAMC111_AUTODPOWERDOWN = 388, /*!< Index of access permissions for POWER.AUTOPOWERDOWN register of
                                                                 MRAMC111*/
  NRF_SECURE_SPU111_FEATURES_MRAMC111_READY  = 389,  /*!< Index of access permissions for READY/READYNEXT registers of MRAMC111*/
} NRF_SECURE_SPU111_FEATURES_ENUM_t;

/* ============================================= SPU120 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU120.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_0  = 192,  /*!< Index of access permissions for task pair [1:0] of VPR120            */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_1  = 193,  /*!< Index of access permissions for task pair [3:2] of VPR120            */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_2  = 194,  /*!< Index of access permissions for task pair [5:4] of VPR120            */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_3  = 195,  /*!< Index of access permissions for task pair [7:6] of VPR120            */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_4  = 196,  /*!< Index of access permissions for task pair [9:8] of VPR120            */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_5  = 197,  /*!< Index of access permissions for task pair [11:10] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_6  = 198,  /*!< Index of access permissions for task pair [13:12] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_7  = 199,  /*!< Index of access permissions for task pair [15:14] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_8  = 200,  /*!< Index of access permissions for task pair [17:16] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_9  = 201,  /*!< Index of access permissions for task pair [19:18] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_10 = 202,  /*!< Index of access permissions for task pair [21:20] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_11 = 203,  /*!< Index of access permissions for task pair [23:22] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_12 = 204,  /*!< Index of access permissions for task pair [25:24] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_13 = 205,  /*!< Index of access permissions for task pair [27:26] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_14 = 206,  /*!< Index of access permissions for task pair [29:28] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_15 = 207,  /*!< Index of access permissions for task pair [31:30] of VPR120          */
} NRF_SECURE_SPU120_FEATURES_ENUM_t;

/* ============================================= SPU121 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU121.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_SECURE_SPU121_FEATURES_IPCT120_CH_0    = 0,    /*!< Index of access permissions for channel 0 of IPCT120                 */
  NRF_SECURE_SPU121_FEATURES_IPCT120_CH_1    = 1,    /*!< Index of access permissions for channel 1 of IPCT120                 */
  NRF_SECURE_SPU121_FEATURES_IPCT120_CH_2    = 2,    /*!< Index of access permissions for channel 2 of IPCT120                 */
  NRF_SECURE_SPU121_FEATURES_IPCT120_CH_3    = 3,    /*!< Index of access permissions for channel 3 of IPCT120                 */
  NRF_SECURE_SPU121_FEATURES_IPCT120_CH_4    = 4,    /*!< Index of access permissions for channel 4 of IPCT120                 */
  NRF_SECURE_SPU121_FEATURES_IPCT120_CH_5    = 5,    /*!< Index of access permissions for channel 5 of IPCT120                 */
  NRF_SECURE_SPU121_FEATURES_IPCT120_CH_6    = 6,    /*!< Index of access permissions for channel 6 of IPCT120                 */
  NRF_SECURE_SPU121_FEATURES_IPCT120_CH_7    = 7,    /*!< Index of access permissions for channel 7 of IPCT120                 */
} NRF_SECURE_SPU121_FEATURES_ENUM_t;

/* ============================================= SPU122 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU122.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CH_0   = 32,   /*!< Index of access permissions for channel 0 of DPPIC120                */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CH_1   = 33,   /*!< Index of access permissions for channel 1 of DPPIC120                */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CH_2   = 34,   /*!< Index of access permissions for channel 2 of DPPIC120                */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CH_3   = 35,   /*!< Index of access permissions for channel 3 of DPPIC120                */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CH_4   = 36,   /*!< Index of access permissions for channel 4 of DPPIC120                */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CH_5   = 37,   /*!< Index of access permissions for channel 5 of DPPIC120                */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CH_6   = 38,   /*!< Index of access permissions for channel 6 of DPPIC120                */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CH_7   = 39,   /*!< Index of access permissions for channel 7 of DPPIC120                */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CHG_0  = 56,   /*!< Index of access permissions for channel group 0 of DPPIC120          */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CHG_1  = 57,   /*!< Index of access permissions for channel group 1 of DPPIC120          */
} NRF_SECURE_SPU122_FEATURES_ENUM_t;

