ankuns/nrfx/bsp/stable/mdk/nrf7140_secure_peripherals.h
/* ============================================= SPU133 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU133.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_SECURE_SPU133_FEATURES_DPPIC132_CH_0   = 32,   /*!< Index of access permissions for channel 0 of DPPIC132                */
  NRF_SECURE_SPU133_FEATURES_DPPIC132_CH_1   = 33,   /*!< Index of access permissions for channel 1 of DPPIC132                */
  NRF_SECURE_SPU133_FEATURES_DPPIC132_CH_2   = 34,   /*!< Index of access permissions for channel 2 of DPPIC132                */
  NRF_SECURE_SPU133_FEATURES_DPPIC132_CH_3   = 35,   /*!< Index of access permissions for channel 3 of DPPIC132                */
  NRF_SECURE_SPU133_FEATURES_DPPIC132_CH_4   = 36,   /*!< Index of access permissions for channel 4 of DPPIC132                */
  NRF_SECURE_SPU133_FEATURES_DPPIC132_CH_5   = 37,   /*!< Index of access permissions for channel 5 of DPPIC132                */
  NRF_SECURE_SPU133_FEATURES_DPPIC132_CH_6   = 38,   /*!< Index of access permissions for channel 6 of DPPIC132                */
  NRF_SECURE_SPU133_FEATURES_DPPIC132_CH_7   = 39,   /*!< Index of access permissions for channel 7 of DPPIC132                */
  NRF_SECURE_SPU133_FEATURES_DPPIC132_CHG_0  = 56,   /*!< Index of access permissions for channel group 0 of DPPIC132          */
  NRF_SECURE_SPU133_FEATURES_DPPIC132_CHG_1  = 57,   /*!< Index of access permissions for channel group 1 of DPPIC132          */
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_0       = 128,  /*!< Index of access permissions for compare and capture channel 0 of GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_1       = 129,  /*!< Index of access permissions for compare and capture channel 1 of GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_2       = 130,  /*!< Index of access permissions for compare and capture channel 2 of GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_3       = 131,  /*!< Index of access permissions for compare and capture channel 3 of GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_4       = 132,  /*!< Index of access permissions for compare and capture channel 4 of GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_5       = 133,  /*!< Index of access permissions for compare and capture channel 5 of GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_6       = 134,  /*!< Index of access permissions for compare and capture channel 6 of GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_7       = 135,  /*!< Index of access permissions for compare and capture channel 7 of GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_8       = 136,  /*!< Index of access permissions for compare and capture channel 8 of GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_9       = 137,  /*!< Index of access permissions for compare and capture channel 9 of GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_10      = 138,  /*!< Index of access permissions for compare and capture channel 10 of
                                                          GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_11      = 139,  /*!< Index of access permissions for compare and capture channel 11 of
                                                          GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_12      = 140,  /*!< Index of access permissions for compare and capture channel 12 of
                                                          GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_13      = 141,  /*!< Index of access permissions for compare and capture channel 13 of
                                                          GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_14      = 142,  /*!< Index of access permissions for compare and capture channel 14 of
                                                          GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_15      = 143,  /*!< Index of access permissions for compare and capture channel 15 of
                                                          GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_16      = 144,  /*!< Index of access permissions for compare and capture channel 16 of
                                                          GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_17      = 145,  /*!< Index of access permissions for compare and capture channel 17 of
                                                          GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_CC_18      = 146,  /*!< Index of access permissions for compare and capture channel 18 of
                                                          GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_PWMCONFIG  = 157,  /*!< Index of access permissions for PWMCONFIG register of GRTC           */
  NRF_SECURE_SPU133_FEATURES_GRTC_CLK        = 158,  /*!< Index of access permissions for CLKOUT/CLKCFG registers of GRTC      */
  NRF_SECURE_SPU133_FEATURES_GRTC_SYSCOUNTER = 159,  /*!< Index of access permissions for SYSCOUNTERL/SYSCOUNTERH registers of
                                                          GRTC*/
  NRF_SECURE_SPU133_FEATURES_GRTC_INTERRUPT_0 = 160, /*!< Index of access permissions for interrupt 0 of GRTC                  */
  NRF_SECURE_SPU133_FEATURES_GRTC_INTERRUPT_1 = 161, /*!< Index of access permissions for interrupt 0 of GRTC                  */
  NRF_SECURE_SPU133_FEATURES_GRTC_INTERRUPT_2 = 162, /*!< Index of access permissions for interrupt 0 of GRTC                  */
  NRF_SECURE_SPU133_FEATURES_GRTC_INTERRUPT_3 = 163, /*!< Index of access permissions for interrupt 0 of GRTC                  */
  NRF_SECURE_SPU133_FEATURES_GRTC_INTERRUPT_4 = 164, /*!< Index of access permissions for interrupt 0 of GRTC                  */
  NRF_SECURE_SPU133_FEATURES_GRTC_INTERRUPT_5 = 165, /*!< Index of access permissions for interrupt 0 of GRTC                  */
  NRF_SECURE_SPU133_FEATURES_GRTC_INTERRUPT_6 = 166, /*!< Index of access permissions for interrupt 0 of GRTC                  */
  NRF_SECURE_SPU133_FEATURES_GRTC_INTERRUPT_7 = 167, /*!< Index of access permissions for interrupt 0 of GRTC                  */
  NRF_SECURE_SPU133_FEATURES_GRTC_INTERRUPT_8 = 168, /*!< Index of access permissions for interrupt 0 of GRTC                  */
  NRF_SECURE_SPU133_FEATURES_GRTC_INTERRUPT_9 = 169, /*!< Index of access permissions for interrupt 0 of GRTC                  */
  NRF_SECURE_SPU133_FEATURES_GRTC_INTERRUPT_10 = 170, /*!< Index of access permissions for interrupt 0 of GRTC                 */
  NRF_SECURE_SPU133_FEATURES_GRTC_INTERRUPT_11 = 171, /*!< Index of access permissions for interrupt 0 of GRTC                 */
  NRF_SECURE_SPU133_FEATURES_GRTC_INTERRUPT_12 = 172, /*!< Index of access permissions for interrupt 0 of GRTC                 */
  NRF_SECURE_SPU133_FEATURES_GRTC_INTERRUPT_13 = 173, /*!< Index of access permissions for interrupt 0 of GRTC                 */
  NRF_SECURE_SPU133_FEATURES_GRTC_INTERRUPT_14 = 174, /*!< Index of access permissions for interrupt 0 of GRTC                 */
} NRF_SECURE_SPU133_FEATURES_ENUM_t;

/* ============================================= SPU134 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU134.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_SECURE_SPU134_FEATURES_DPPIC133_CH_0   = 32,   /*!< Index of access permissions for channel 0 of DPPIC133                */
  NRF_SECURE_SPU134_FEATURES_DPPIC133_CH_1   = 33,   /*!< Index of access permissions for channel 1 of DPPIC133                */
  NRF_SECURE_SPU134_FEATURES_DPPIC133_CH_2   = 34,   /*!< Index of access permissions for channel 2 of DPPIC133                */
  NRF_SECURE_SPU134_FEATURES_DPPIC133_CH_3   = 35,   /*!< Index of access permissions for channel 3 of DPPIC133                */
  NRF_SECURE_SPU134_FEATURES_DPPIC133_CH_4   = 36,   /*!< Index of access permissions for channel 4 of DPPIC133                */
  NRF_SECURE_SPU134_FEATURES_DPPIC133_CH_5   = 37,   /*!< Index of access permissions for channel 5 of DPPIC133                */
  NRF_SECURE_SPU134_FEATURES_DPPIC133_CH_6   = 38,   /*!< Index of access permissions for channel 6 of DPPIC133                */
  NRF_SECURE_SPU134_FEATURES_DPPIC133_CH_7   = 39,   /*!< Index of access permissions for channel 7 of DPPIC133                */
  NRF_SECURE_SPU134_FEATURES_DPPIC133_CHG_0  = 56,   /*!< Index of access permissions for channel group 0 of DPPIC133          */
  NRF_SECURE_SPU134_FEATURES_DPPIC133_CHG_1  = 57,   /*!< Index of access permissions for channel group 1 of DPPIC133          */
} NRF_SECURE_SPU134_FEATURES_ENUM_t;

/* ============================================= SPU135 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU135.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_SECURE_SPU135_FEATURES_DPPIC134_CH_0   = 32,   /*!< Index of access permissions for channel 0 of DPPIC134                */
  NRF_SECURE_SPU135_FEATURES_DPPIC134_CH_1   = 33,   /*!< Index of access permissions for channel 1 of DPPIC134                */
  NRF_SECURE_SPU135_FEATURES_DPPIC134_CH_2   = 34,   /*!< Index of access permissions for channel 2 of DPPIC134                */
  NRF_SECURE_SPU135_FEATURES_DPPIC134_CH_3   = 35,   /*!< Index of access permissions for channel 3 of DPPIC134                */
  NRF_SECURE_SPU135_FEATURES_DPPIC134_CH_4   = 36,   /*!< Index of access permissions for channel 4 of DPPIC134                */
  NRF_SECURE_SPU135_FEATURES_DPPIC134_CH_5   = 37,   /*!< Index of access permissions for channel 5 of DPPIC134                */
  NRF_SECURE_SPU135_FEATURES_DPPIC134_CH_6   = 38,   /*!< Index of access permissions for channel 6 of DPPIC134                */
  NRF_SECURE_SPU135_FEATURES_DPPIC134_CH_7   = 39,   /*!< Index of access permissions for channel 7 of DPPIC134                */
  NRF_SECURE_SPU135_FEATURES_DPPIC134_CHG_0  = 56,   /*!< Index of access permissions for channel group 0 of DPPIC134          */
  NRF_SECURE_SPU135_FEATURES_DPPIC134_CHG_1  = 57,   /*!< Index of access permissions for channel group 1 of DPPIC134          */
} NRF_SECURE_SPU135_FEATURES_ENUM_t;

/* ============================================= SPU136 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU136.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_SECURE_SPU136_FEATURES_DPPIC135_CH_0   = 32,   /*!< Index of access permissions for channel 0 of DPPIC135                */
  NRF_SECURE_SPU136_FEATURES_DPPIC135_CH_1   = 33,   /*!< Index of access permissions for channel 1 of DPPIC135                */
  NRF_SECURE_SPU136_FEATURES_DPPIC135_CH_2   = 34,   /*!< Index of access permissions for channel 2 of DPPIC135                */
  NRF_SECURE_SPU136_FEATURES_DPPIC135_CH_3   = 35,   /*!< Index of access permissions for channel 3 of DPPIC135                */
  NRF_SECURE_SPU136_FEATURES_DPPIC135_CH_4   = 36,   /*!< Index of access permissions for channel 4 of DPPIC135                */
  NRF_SECURE_SPU136_FEATURES_DPPIC135_CH_5   = 37,   /*!< Index of access permissions for channel 5 of DPPIC135                */
  NRF_SECURE_SPU136_FEATURES_DPPIC135_CH_6   = 38,   /*!< Index of access permissions for channel 6 of DPPIC135                */
  NRF_SECURE_SPU136_FEATURES_DPPIC135_CH_7   = 39,   /*!< Index of access permissions for channel 7 of DPPIC135                */
  NRF_SECURE_SPU136_FEATURES_DPPIC135_CHG_0  = 56,   /*!< Index of access permissions for channel group 0 of DPPIC135          */
  NRF_SECURE_SPU136_FEATURES_DPPIC135_CHG_1  = 57,   /*!< Index of access permissions for channel group 1 of DPPIC135          */
} NRF_SECURE_SPU136_FEATURES_ENUM_t;

