ankuns/nrfx/bsp/stable/mdk/nrf7140_secure_peripherals.h
/* ============================================= SPU137 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU137.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_SECURE_SPU137_FEATURES_DPPIC136_CH_0   = 32,   /*!< Index of access permissions for channel 0 of DPPIC136                */
  NRF_SECURE_SPU137_FEATURES_DPPIC136_CH_1   = 33,   /*!< Index of access permissions for channel 1 of DPPIC136                */
  NRF_SECURE_SPU137_FEATURES_DPPIC136_CH_2   = 34,   /*!< Index of access permissions for channel 2 of DPPIC136                */
  NRF_SECURE_SPU137_FEATURES_DPPIC136_CH_3   = 35,   /*!< Index of access permissions for channel 3 of DPPIC136                */
  NRF_SECURE_SPU137_FEATURES_DPPIC136_CH_4   = 36,   /*!< Index of access permissions for channel 4 of DPPIC136                */
  NRF_SECURE_SPU137_FEATURES_DPPIC136_CH_5   = 37,   /*!< Index of access permissions for channel 5 of DPPIC136                */
  NRF_SECURE_SPU137_FEATURES_DPPIC136_CH_6   = 38,   /*!< Index of access permissions for channel 6 of DPPIC136                */
  NRF_SECURE_SPU137_FEATURES_DPPIC136_CH_7   = 39,   /*!< Index of access permissions for channel 7 of DPPIC136                */
  NRF_SECURE_SPU137_FEATURES_DPPIC136_CHG_0  = 56,   /*!< Index of access permissions for channel group 0 of DPPIC136          */
  NRF_SECURE_SPU137_FEATURES_DPPIC136_CHG_1  = 57,   /*!< Index of access permissions for channel group 1 of DPPIC136          */
} NRF_SECURE_SPU137_FEATURES_ENUM_t;


#ifdef __cplusplus
}
#endif
#endif /* NRF7140_SECURE_PERIPHERALS_H */

